app/controllers/api/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."shopper_id" = $1  [["shopper_id", nil]]
---
    def index
        @products = Cart.where(shopper_id: params[:shopper_id])