app/controllers/api/products_controller.rb

    def create
        @product = Product.new(product_params)
        if @product.save
---
INSERT INTO "products" ("name", "description", "price", "category", "location", "owner_id", "created_at", "updated_at", "free_shipping") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def index
        if params[:category] == "" || params[:category].nil?
            @products = Product.all
            render '/api/products/index'
        else
            @products = Product.where(category: params[:category])
---
SELECT  "products".* FROM "products" WHERE (20) LIMIT $1  [["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."category" = $1  [["category", "home-living"]]