app/controllers/api/reviews_controller.rb

  def create
    @review = Review.create(review_params)

    if @review.save
---
INSERT INTO "reviews" ("body", "rating", "author_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", ""], ["rating", 5], ["author_id", 2], ["product_id", 0], ["created_at", "2020-12-10 01:25:16.788814"], ["updated_at", "2020-12-10 01:25:16.788814"]]